In [76]:
import pandas as pd
import os

In [77]:
student_data = os.path.join('./Resources/new_full_student_data.csv')
student_df = pd.read_csv(student_data)

In [78]:
student_df.head()

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
0,103880842,Travis Martin,9th,Sullivan High School,59.0,88.2,Public,961125
1,45069750,Michael Brown,9th,Dixon High School,94.7,73.5,Charter,870334
2,45024902,Gabriela Lucero,9th,Wagner High School,89.0,70.4,Public,846745
3,62582498,Susan Richardson,9th,Silva High School,69.7,80.3,Public,991918
4,16437227,Sherry Davis,11th,Bowers High School,NaN,27.5,Public,848324

In [79]:
student_df.isna().sum()
student_df = student_df.dropna()

In [27]:
student_df.isna().sum()

student_id       0
student_name     0
grade            0
school_name      0
reading_score    0
math_score       0
school_type      0
school_budget    0
dtype: int64

In [28]:
student_df.duplicated().sum()

1836

In [29]:
student_df = student_df.drop_duplicates()
student_df.duplicated().sum()

0

In [30]:
student_df.dtypes

student_id         int64
student_name      object
grade             object
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [32]:
student_df['grade'] = student_df['grade'].str.replace('th', '')
student_df['grade']

0         9
1         9
2         9
3         9
5         9
         ..
19508    10
19509    12
19511    11
19512    11
19513    12
Name: grade, Length: 14831, dtype: object

In [33]:
student_df['grade'] = student_df['grade'].astype(int)
student_df.dtypes

student_id         int64
student_name      object
grade              int32
school_name       object
reading_score    float64
math_score       float64
school_type       object
school_budget      int64
dtype: object

In [34]:
student_df.describe()

         student_id         grade  reading_score    math_score  school_budget
count  1.483100e+04  14831.000000   14831.000000  14831.000000   14831.000000
mean   6.975296e+07     10.355539      72.357865     64.675733  893742.749107
std    3.452909e+07      1.097728      15.224590     15.844093   53938.066467
min    1.000906e+07      9.000000      10.500000      3.700000  817615.000000
25%    3.984433e+07      9.000000      62.200000     54.500000  846745.000000
50%    6.965978e+07     10.000000      73.800000     65.300000  893368.000000
75%    9.927449e+07     11.000000      84.000000     76.000000  956438.000000
max    1.299997e+08     12.000000     100.000000    100.000000  991918.000000

In [96]:
student_df["math_score"].mean()

64.58956020879589

In [99]:
min_reading_score = student_df['reading_score'].min()
min_reading_score

10.5

In [100]:
student_df.loc[:,'grade']

0         9
1         9
2         9
3         9
5         9
         ..
19509    12
19510     9
19511    11
19512    11
19513    12
Name: grade, Length: 16667, dtype: object

In [118]:
student_df.iloc[0:3, 3:6]

            school_name  reading_score  math_score
0  Sullivan High School           59.0        88.2
1     Dixon High School           94.7        73.5
2    Wagner High School           89.0        70.4

In [221]:
public_schools_df = student_df.loc[student_df["grade"] == "9"]
public_schools_df.describe()

         student_id  reading_score   math_score  school_budget
count  4.651000e+03    4651.000000  4651.000000    4651.000000
mean   6.989824e+07      69.215029    66.469383  898677.405074
std    3.471276e+07      15.342495    16.668006   54794.764822
min    1.000906e+07      17.900000     5.300000  817615.000000
25%    3.987328e+07      59.000000    55.900000  846745.000000
50%    7.017398e+07      70.100000    67.600000  893368.000000
75%    9.959880e+07      80.600000    78.400000  957299.000000
max    1.299997e+08      99.900000   100.000000  991918.000000

In [147]:
min_reading_score = student_df['reading_score'].min()
min_reading_row = student_df.loc[student_df["reading_score"] == min_reading_score]

In [151]:
min_reading_row

,student_id,student_name,grade,school_name,reading_score,math_score,school_type,school_budget
3706,81758630,Matthew Thomas,10,Dixon High School,10.5,58.4,Charter,870334

In [200]:
average_budget = student_df.groupby(by='school_type').mean()
average_budget.loc[:, ["school_budget"]]

             school_budget
school_type
Charter      872678.180771
Public       911268.214677

In [213]:
group = df.groupby("")

In [ ]:
#3 Find the average math score by grade for each school type by using the groupby and mean functions, as the following image shows: